exercises/exercise06/exercise06.tex
% Created 2025-07-05 Sat 08:44
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[table]{xcolor}
\usepackage[margin=0.9in,bmargin=1.0in,tmargin=1.0in]{geometry}
\usepackage{algorithm2e}
\usepackage{algorithm}
\usepackage{amsmath}
\usepackage{arydshln}
\usepackage{subcaption}
\newcommand{\point}[1]{\noindent \textbf{#1}}
\usepackage{hyperref}
\usepackage{csquotes}
\usepackage{graphicx}
\usepackage{bm}
\usepackage{subfig}
\usepackage[mla]{ellipsis}
\parindent = 0em
\setlength\parskip{.5\baselineskip}
\usepackage{pgf}
\usepackage{tikz}
\usetikzlibrary{shapes,arrows,automata,quotes}
\usepackage[latin1]{inputenc}
\usepackage{adjustbox}
\author{Prof. Rodrigo Ribeiro}
\date{05-07-2025}
\title{Exercício prático 06\\\medskip
\large BCC328 - Construção de Compiladores I}
\hypersetup{
 pdfauthor={Prof. Rodrigo Ribeiro},
 pdftitle={Exercício prático 06},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Finalização de um interpretador para a linguagem L3}
\label{sec:org822e67f}

O objetivo desta atividade é finalizar a implementação de um interpretador para  a linguagem L3,
para a qual adicionamos a verificação de tipos.
\section*{A Linguagem L3}
\label{sec:org40f3485}

A linguagem L3 consiste na extensão de L1 por permitir a definição de variáveis com seus
respectivos tipos. A seguir apresentamos a sintaxe, regras do sistema de tipos e
alterações necessárias na semântica de L1 para acomodar as novas contruções presentes em
L3.
\subsection*{Sintaxe da linguagem L3}
\label{sec:orgb900fe1}

A sintaxe da linguagem L3 é definida pela seguinte gramática livre de contexto:

\begin{array}{ll}
P & \to\:  S\, P\:|\:\lambda\\
S & \to\:  let\:v : \tau := E ;\\
  & \mid\: read(E,v);\,|\,print(E); \,|\, S_1 ; S_2\\
T & \mid\:Int\,|\,Bool\,|\,String\\
E & \to\:  n \,|\, v \,|\, s\,|\, b\,|\,E + E\,|\, E - E\,|\,E*E\\
  & \mid\:E < E\,|\,E = E\,|\,E / E\,|\,E\,\&\&\,E\,|\,!\,E\\
  & \mid\: strcat(E,E)\,|\,strsize(E)\,|\,i2s(E)\,|\,i2b(E)\\
  & \mid\: b2s(E)\,|\,b2i(E)\,|\,s2i(E)\,|\,s2b(E)\\
\end{array}

A gramática é formada por quatro variáveis: \(P,\,T,\,S\) e \(E\); e pelos seguintes tokens
(símbolos do alfabeto):

\begin{itemize}
\item \(let\): inicia a declaração de uma variável.

\item \(v\): representam identificadores. O token de identificador segue as regras usuais
presentes em linguagens de programação: um identitificador começa com uma letra
seguida de uma sequência de zero ou mais dígitos ou letras.

\item \(n\): representam constantes numéricas. No momento, vamos suportar apenas números
inteiros (tanto positivos, quanto negativos).

\item \(s\): representam literais de strings. A linguagem L3 utiliza aspas duplas para
delimitar literais de string.
\item Operadores aritméticos (+,*,- e /) , relacionais (< e =), lógicos (! e \&\&),
operadores sobre strings (strcat e strsize) e operações para conversão entre tipos
(i2b, i2s, b2s, b2i, s2i e s2b).
\end{itemize}

A sintaxe abstrata de L3 é representada pelos seguintes tipos de dados:

\begin{verbatim}
data L3
  = L3 [S3]

data Ty
  = TString | TInt | TBool

data S3
  = SLet Var Ty E3
  | SAssign Var E3
  | SRead E3 Var
  | SPrint E3
\end{verbatim}

Adicionalmente, a sintaxe de expressões é dada pelo seguinte tipo:

\begin{verbatim}
data E3
  = EValue Value
  -- initially, Nothing, after type checking
  -- we include its type.
  | EVar Var (Maybe Ty)
  -- arithmetic operators
  | EAdd E3 E3
  | EMult E3 E3
  | EMinus E3 E3
  | EDiv E3 E3
  -- Relational operators
  | ELt E3 E3
  | EEq E3 E3
  -- Boolean operators
  | EAnd E3 E3
  | ENot E3
  -- string operators
  | ECat E3 E3
  | ESize E3
  -- type coercion
  | EI2S E3
  | EI2B E3
  | ES2I E3
  | ES2B E3
  | EB2S E3
  | EB2I E3
\end{verbatim}

O tipo \texttt{L3} representa a variável P, \texttt{S3} denota a variável S e \texttt{E3} representa a
variável E da gramática de L3. Por sua vez, o tipo \texttt{Ty} representa a variável T.
A ocorrência de uma variável em uma expressão possui um valor de tipo \texttt{Maybe Ty}.
Durante a análise sintática, a variáveis possuem o valor \texttt{Nothing} para este componente e
depois da verificação de tipos, este é substituído por \texttt{Just t}, em que \texttt{t} é o tipo
associado a esta variável no contexto.
\subsection*{Semântica de L3}
\label{sec:orgda3b6d8}

A semântica de L3 é exatamente a de L1 com novas regras para lidar com novas operações, que
é similar a de outros operadores presentes em L1.
\section*{Detalhes da entrega}
\label{sec:org77830f5}

\subsection*{O que deverá ser implementado}
\label{sec:org55f3f6b}

Você deverá implementar:

\begin{itemize}
\item Analisador léxico para L3.

\item Analisador sintático para L3.

\item Interpretador para L3.
\end{itemize}

A seguir, detalharemos a estrutura pré-definida do projeto para L3.
A primeira função \texttt{lexerOnly} deve realizar a análise léxica sobre o
arquivo de entrada e imprimir os tokens encontrados, como feito para a
implementação de L1 e L2, em exercícios anteriores.

\begin{verbatim}
lexerOnly :: FilePath -> IO ()
lexerOnly file = error "Not implemented!"
\end{verbatim}

A segunda função, \texttt{parserOnly}, deve realizar a análise léxica e sintática sobre o
arquivo de entrada e imprimir a árvores de sintaxe produzida, como feito para a
implementação de L1 e L2.

\begin{verbatim}
parserOnly :: FilePath -> IO ()
parserOnly file = error "Not implemented!"
\end{verbatim}

A terceira função, \texttt{typecheckOnly}, deve realizar a análise léxica, sintática e
verificação de tipos sobre o arquivo de entrada, imprimindo a árvore com as anotações
de tipos em cada ocorrência de variável no programa.

\begin{verbatim}
typecheckOnly :: FilePath -> IO ()
typecheckOnly file = error "Not implemented!"
\end{verbatim}

Finalmente, a última função, \texttt{interpret}, deve realizar a interpretação do programa
contido no arquivo fonte fornecido. Para isso, você deverá executar a análise léxica,
sintática, verificação de tipos e executar o programa representado dpela árvore
produzida por todas as etapas de análise de L3.

\begin{verbatim}
interpret :: FilePath -> IO ()
interpret file = error "Not implemented!"
\end{verbatim}

todas essa funções estão presentes no arquivo src/L3/L3.hs, que é o arquivo principal
para implementações da linguagem L3.
A implementação da árvore sintática para programas L3 está presente no arquivo \texttt{Syntax.hs}
na pasta L3.Frontend.

Adicione novos módulos ou funções a módulos existentes como julgar necessário.
\subsection*{Como será feita a entrega}
\label{sec:org2afc33d}

\begin{itemize}
\item As entregas serão feitas utilizando a plataforma Github classroom.
\end{itemize}
\end{document}
